Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Returns an array with respective elements g, s and t.
es: Returns array with respective elements g, s and t.

source: Returns the hamming distance between a and b.
es: Returns the hamming distance between a and a.

source: Creates a GMP number from an integer or string.
es: Creates a GMP number from integer or string.

source: This function returns a useful result only if the number actually fits the PHP integer (i.e., signed long type).
es: This function returns useful result only if the number actually fits the PHP integer (i.e., signed long type).

source: Returns TRUE if a is a perfect square, FALSE otherwise.
es: Returns TRUE if a is a prefect square, FALSE otherwise.

source: The number will be between limiter and zero in value.
es: The number will be up to limiter words long.

source: Converting a GMP number to a string
es: Converting GMP number to string

source: Subtracts b from a and returns the result.
es: Subtract b from a and returns the result.

source: HTTP functions
es: Funciones HTTP

source: Behaves the same as strftime() except that the time returned is Greenwich Mean Time (GMT).
es: Se comporta como strftime(), excepto en que la hora devuelta es la de Greenwich (GMT).

source: For example, when run in Eastern Standard Time (GMT -0500), the first line below prints "Dec 31 1998 20:00:00", while the second prints "Jan 01 1999 01:00:00 ".
es: Por ejemplo, si se utiliza en la zona horaria EST (GMT -0500), la primera línea del ejemplo imprime "Dec 31 1998 20:00:00", mientras la segunda imprime "Jan 01 1999 01:00:00 ".

source: Example 1. gmstrftime() example
es: Ejemplo de gmstrftime()

source: See also strftime().
es: Ver también strftime().

source: Valid Range for Gregorian Calendar 4714 B.C. to 9999 A.D.
es: El rango válido para el Calendario Gregoriano es desde el 4714 A.C. hasta el 9999 D.C.

source: Although this function can handle dates all the way back to 4714 B.C., such use may not be meaningful.
es: Aunque este programa puede manejar fechas tan lejanas como el 4714 A.C., usarlo no tendría sentido.

source: The Gregorian calendar was not instituted until October 15, 1582 (or October 5, 1582 in the Julian calendar).
es: El calendario Gregoriano fue instituído el 15 de octubre de 1582 (o el 5 de octubre de 1582 en el calendario Juliano).

source: Some countries did not accept it until much later.
es: Algunos países no lo aceptaron hasta mucho después.

source: For example, Britain converted in 1752, The USSR in 1918 and Greece in 1923.
es: Por ejemplo, Gran Bretaña se convirtió en 1752, la URSS en 1918 y Grecia en 1923.

source: Most European countries used the Julian calendar prior to the Gregorian.
es: Muchos países europeos usaron el calendario Juliano antes que el Gregoriano.

source: The gz-file pointed to by zp is closed.
es: El archivo-gz al que apunta zp se cierra.

source: The gz-file pointer must be valid, and must point to a file successfully opened by gzopen().
es: El puntero al archivo-gz debe ser válido y debe apuntar a un archivo correctamente abierto con gzopen().

source: Returns TRUE if the gz-file pointer is at EOF or an error occurs; otherwise returns FALSE.
es: De otro modo devuelve falso.

source: Identical to readgzfile(), except that gzfile() returns the file in an array.
es: Identico a readgzfile(), solo que gzfile() devuelve el fichero en un arreglo.

source: You can use the optional second parameter and set it to "1", if you want to search for the file in the include_path, too.
es: Se puede usar el segundo parámetro opcional poniéndolo a "1", si se quiere que la función busque también el archivo en la trayectoria definida como include_path.

source: See also readgzfile(), and gzopen().
es: Vea también readgzfile(), y gzopen().

source: Returns a string containing a single (uncompressed) character read from the file pointed to by zp.
es: Devuelve una cadena conteniendo un caracter en particular (sin comprimir) leído del archivo al que apunta zp.

source: Returns FALSE on EOF (as does gzeof()).
es: Devuelve FALSE cuando está al final del archivo (al igual que gzeof()).

source: See also gzopen(), and gzgets().
es: Vea también gzopen(), y gzgets().

source: Returns a (uncompressed) string of up to length - 1 bytes read from the file pointed to by fp.
es: Devuelve una cadena (descomprimida) con longitud - 1 bytes de largo, leída del archivo apuntado por fp.

source: Reading ends when length - 1 bytes have been read, on a newline, or on EOF (whichever comes first).
es: La lectura finaliza cuando se han leído longitud - 1 bytes, ante un salto de linea o un fin-de-archivo (lo que ocurra primero).

source: The file pointer must be valid, and must point to a file successfully opened by gzopen().
es: El puntero al archivo-gz debe ser válido y debe apuntar a un archivo correctamente abierto con gzopen().

source: See also gzopen(), gzgetc(), and fgets().
es: Vea también gzopen(), gzgetc(), y fgets().

source: Identical to gzgets(), except that gzgetss() attempts to strip any HTML and PHP tags from the text it reads.
es: Idéntica a gzgets(), excepto que gzgetss intenta quitar cualquier "tag "HTML o PHP del texto que lee.

source: See also gzgets(), gzopen(), and strip_tags().
es: Véase también gzgets(), gzopen(), y strip_tags().

source: Opens a gzip (.gz) file for reading or writing.
es: Abre un archivo gzip (.gz) para lectura o escritura.

source: The mode parameter is as in fopen() ("rb "or "wb") but can also include a compression level ("wb9") or a strategy: 'f 'for filtered data as in "wb6f", 'h' for Huffman only compression as in "wb1h". (See the description of deflateInit2 in zlib.h for more information about the strategy parameter.)
es: El parámetro modo es, como en fopen() ("rb "o "wb") pero puede incluir tambien el nivel de compresión ("wb9") o la estrategia: 'f 'para filtrado de datos como en "wb6f", 'h' para comprimir solo por Huffman igual que en "wb1h". (Ver la descripción de deflateInit2 en zlib.h para más información sobre el parámetro de estrategia.)

source: gzopen() can be used to read a file which is not in gzip format; in this case gzread() will directly read from the file without decompression.
es: Gzopen puede usarse para leer o escribir un fichero que no esté en formato gzip; en ese caso gzread() leerá el archivo directamente, sin descomprimirlo.

source: gzopen() returns a file pointer to the file opened, after that, everything you read from this file descriptor will be transparently decompressed and what you write gets compressed.
es: Gzopen devuelve un puntero al archivo abierto y luego, cualquier proceso de lectura o escritura relacionado con ese descriptor de archivo, será transparente: se comprimirá o descomprimirá los datos según la necesidad, de manera automática.

source: You can use the optional third parameter and set it to "1", if you want to search for the file in the include_path, too.
es: Se puede usar el tercer parámetro opcional, poniéndolo a "1", si se quiere buscar también el fichero en la trayectoria include_path.

source: Example 1. gzopen() Example
es: Ejemplo 1. ejemplo de gzopen()

source: See also gzclose().
es: Vea también gzclose().

source: Reads to EOF on the given gz-file pointer and writes the (uncompressed) results to standard output.
es: Lee hasta el Fin-De-Archivo del archivo gz dado, y escribe los resultados (descomprimidos) en la salida standard.

source: The gz-file is closed when gzpassthru() is done reading it (leaving zp useless).
es: El archivo-gz es cerrado cuando gzpassthru() termina de leerlo (dejando zp sin utilidad).

source: gzputs() is an alias to gzwrite(), and is identical in every way.
es: gzputs() es un alias a gzwrite(), y es absolutamente idéntico.

source: gzread() reads up to length bytes from the gz-file pointer referenced by zp.
es: gzread() lee hasta longitud bytes del archivo-gz apuntado por el parámetro zp.

source: Reading stops when length (uncompressed) bytes have been read or EOF is reached, whichever comes first.
es: La lectura termina cuando se han leído longitud bytes (descomprimidos) o se alcanza el fin-de-archivo, lo que sucediera primero.

source: / / get contents of a gz-file into a string $filename = "/ usr / local / something.txt.gz"; $zd = gzopen ($filename, "r"); $contents = gzread ($zd, 10000); gzclose ($zd);
es: / / Pone los contenidos del gz, a una cadena $filename = "/ usr / local / algo.txt.gz"; $zd = gzopen ($filename, "r"); $contents = gzread ($zd, 10000); gzclose ($zd);

source: See also gzwrite(), gzopen(), gzgets(), gzgetss(), gzfile(), and gzpassthru().
es: Ver también gzwrite(), gzopen(), gzgets(), gzgetss(), gzfile(), y gzpassthru().

source: Sets the file position indicator for zp to the beginning of the file stream.
es: Reubica el indicador de posición del archivo, al comienzo del mismo.

source: If an error occurs, returns 0.
es: si surge un error, devuelve 0.

source: See also gzseek() and gztell().
es: Ver también: gzseek() y gztell().

source: Sets the file position indicator for the file referenced by zp to offset bytes into the file stream.
es: Busca la posición dentro del archivo zp, indicada en bytes por el parametro de desplazamiento offset.

source: Equivalent to calling (in C) gzseek (zp, offset, SEEK_SET).
es: Es equivalente a llamar (en C) gzseek (zp, offset, SEEK_SET).

source: If the file is opened for reading, this function is emulated but can be extremely slow.
es: Si el archivo se abre para lectura, la función será emulada, pero puede ponerse extremadamente lenta.

source: If the file is opened for writing, only forward seeks are supported; gzseek then compresses a sequence of zeroes up to the new starting position.
es: Si se trata de escritura, solo está soportada la búsqueda hacia adelante; gzseek comprime entonces una secuencia de ceros hasta que alcanza la nueva ubicación.

source: Upon success, returns 0; otherwise, returns -1.
es: Si se completa el pedido con éxito, devuelve 0; de lo contrario, devuelve -1.

source: See also gztell() and gzrewind().
es: Vea también gztell() y gzrewind().

source: Returns the position of the file pointer referenced by zp; i.e., its offset into the file stream.
es: Devuelve la posición dentro del fichero referido por zp; p.e., su desplazamiento en el cuerpo del archivo.

source: See also gzopen(), gzseek() and gzrewind().
es: Ver también gzopen(), gzseek() y gzrewind().

source: gzwrite() writes the contents of string to the gz-file stream pointed to by zp.
es: gzwrite() escribe el contenido de cadena al fichero gz referido por zp.

source: gzwrite() returns the number of (uncompressed) bytes written to the gz-file stream pointed to by zp.
es: Si el parámetro largo está presente, se detendrá la escritura luego de escribir largo bytes (descomprimidos) o al llegar el final de la cadena, lo que ocurriese primero.

source: Note that if the length argument is given, then the magic_quotes_runtime configuration option will be ignored and no slashes will be stripped from string.
es: Note que si se pasa el argumento largo, la opcion magic_quotes_runtime será ignorada y no se quitarán barras de la cadena en cuestión.

source: See also gzread(), gzopen(), and gzputs().
es: Ver también gzread(), gzopen(), y gzputs().

source: By default it will replace, but if you pass in FALSE as the second argument you can force multiple headers of the same type.
es: La función header() se utiliza al comienzo de un fichero HTML para enviar las cadenas de texto de la cabecera HTTP.

source: There are two special-case header calls.
es: Consulte la Especificación HTTP 1.1 para obtener más información sobre las cabeceras http.

source: For example, if you have configured Apache to use a PHP script to handle requests for missing files (using the ErrorDocument directive), you may want to make sure that your script generates the proper status code.
es: Nota:

source: The status may be overridden by calling header() with a new status line at any time unless the HTTP headers have already been sent.
es: Recuerde que la función header() debe llamarse antes de que se genere salida alguna, bien con etiquetas HTML normales o con PHP.

source: You can achieve the same effect using the Status header.
es: Un error muy frecuente consiste en leer código con include() o con auto_prepend, y que dicho código inserte espacios o líneas en blanco antes de llamar a header().

source: The second special case is the "Location:" header.
es: Hay dos casos especiales de llamadas a header.

source: ?php header( "Location: http: / /www.example.com / "); / * Redirect browser * / exit; / * Make sure that code below does not get executed when we redirect. * /?
es: La primera es la cabecera "Location".

source: You can usually use $_SERVER[ 'HTTP_HOST'], $_SERVER['PHP_SELF'] and dirname() to make an absolute URI from a relative one yourself:
es: No sólo envía esta cabecera al navegador, sino que también devuelve un código de estado REDIRECT a Apache.

source: PHP scripts often generate dynamic content that must not be cached by the client browser or any proxy caches between the server and the client browser.
es: Desde el punto de vista del programador de scripts esto no debería ser importante, pero para la gente que comprende las interioridades de Apache sí puede serlo.

source: There are a number of options that users may be able to set for their browser that change its default caching behavior.
es: header( "Location: http: / /www.php.net"); / * Redirect browser to PHP web site * / exit; / * Make sure that code below does not get executed when we redirect. * /

source: Additionally, session_cache_limiter() and the session.cache_limiter configuration setting can be used to automatically generate the correct caching-related headers when sessions are being used.
es: El segundo caso especial se produce con cualquier cabecera que comience con la cadena, "HTTP /" (las mayúsculas no son significativas).

source: It is a very common error to read code with include(), or require(), functions, or another file access function, and have spaces or empty lines that are output before header() is called.
es: Por ejemplo, si tiene la directiva ErrorDocument 404 de Apache apuntando a un script PHP, es una buena idea asegurarse de que su script de PHP genera realmente un 404.

source: html ?php / / This will give an error.
es: La primera cosa que debe hacer en su script sería:

source: You can do this by calling ob_start() and ob_end_flush() in your script, or setting the output_buffering configuration directive on in your php.ini or server configuration files.
es: Los scripts de PHP a menudo generan HTML dinámico que no debe almacenarse en la caché del navegador cliente o en la caché de cualquier proxy situado entre el servidor y el navegador cliente.

source: ?php / / We' ll be outputting a PDF header("Content-type: application / pdf"); / / It will be called downloaded.pdf header("Content-Disposition: attachment; filename=downloaded.pdf"); / / The PDF source is in original.pdf readfile('original.pdf');?
es: Se puede obligar a muchos proxies y clientes a que deshabiliten el almacenamiento en caché con

source: There is also a bug in Microsoft Internet Explorer 5.5 that interferes with this, which can be resolved by upgrading to Service Pack 2 or later.
es: header( "Expires:

source: See also headers_sent(), setcookie(), and the section on HTTP authentication.
es: Mon, 26 Jul 1997 05:00:00 GMT"); / / Date in the past header("Last-Modified: ". gmdate("D, d M Y H:i:s")." GMT"); / / always modified header("Cache-Control: no-cache, must-revalidate"); / / HTTP / 1.1 header("Pragma: no-cache"); / / HTTP / 1.0

source: This function is similar to hebrev() This function is similar to hebrev() with the difference that it converts newlines (\n) to "br \n".
es: Esta funcion es similar a hebrev() Esta funcion es similar a hebrev() con la diferencia que convierte las nuevas líneas (\n) a "br \n".

source: The optional parameter max_chars_per_line indicates maximum number of characters per line will be output.
es: El parámetro opcional max_cars_por_linea indica el máximo número de caracteres que se emitirán por línea.

source: The function tries to avoid breaking words.
es: La función intenta evitar cortar palabras.

source: See also hebrev()
es: Vea también hebrev()

source: See also hebrevc()
es: Vea también hebrevc()

source: Returns the decimal equivalent of the hexadecimal number represented by the hex_string argument. hexdec() converts a hexadecimal string to a decimal number.
es: Devuelve el equivalente decimal de el número hexadecimal representado por el argumento hex_string.

source: hexdec() will replace of any non-hexadecimal characters it encounters by 0.
es: HexDec convierte una cadena hexadecimal en un número decimal.

source: Example 1. hexdec() example
es: El número mayor que puede ser convertido es 7fffffff o 2147483647 en decimal.

source: See also dechex().
es: Vea también la función dechex().

source: Like htmlspecialchars(), it takes an optional third argument which defines character set used in conversion.
es: Esta función es del todo idéntica a htmlspecialchars(), excepto que traduce todos los caracteres que tienen equivalente como entidad HTML.

source: Presently, the ISO-8859-1 character set is used as the default.
es: Actualmente se utiliza el juego de caracteres ISO-8859-1.

source: See also html_entity_decode(), get_html_translation_table(), htmlspecialchars(), nl2br(), and urlencode().
es: Vea también htmlspecialchars() y nl2br().

source: This function returns a string with some of these conversions made; the translations made are those most useful for everyday web programming.
es: Ciertos caracteres tienen significados especiales en HTML, y deben ser representados por entidades HTML si se desea preservar su significado.

source: This function is useful in preventing user-supplied text from containing HTML markup, such as in a message board or guest book application.
es: Esta función devuelve una cadena con dichas conversiones realizadas.

source: The default mode, ENT_COMPAT, is the backwards compatible mode which only translates the double-quote character and leaves the single-quote untranslated.
es: Esta función es útil para evitar que el texo entrado por el usuario contenga marcas HTML, como ocurre en aplicaciones de foros o libros de visita.

source: The translations performed are:
es: Actualmente, las traducciones hechas son:

source: '"' (double quote) becomes' quot; 'when ENT_NOQUOTES is not set.
es: '' (ampersand) se convierte en 'amp;'

source: '' (less than) becomes' lt; '
es: '"' (doble comilla) se convierte en 'quot;'

source: Example 1. htmlspecialchars() example
es: '' (menor que) se convierte en 'lt;'

source: Note that this function does not translate anything beyond what is listed above.
es: '' (mayor que) se convierte en 'gt;'

source: Support for the optional second argument was added in PHP 3.0.17 and PHP 4.0.3.
es: Nótese que esta función no traduce nada más que lo mostrado más arriba.

source: The default character set is ISO-8859-1.
es: Para una traducción de entidades completa, vea htmlentities().

source: See also get_html_translation_table(), htmlentities() and nl2br().
es: Vea también htmlentities() y nl2br().

source: Converts an object_array into an object record.
es: Convierte una tabla_objetos en un registro de objeto.

source: Multiple attributes like 'Title' in different languages are treated properly.
es: Los atributos múltiples como 'Título' en distintos idiomas son tratados correctamente.

source: See also hw_objrec2array().
es: Vea también hw_objrec2array().

source: Returns an array of object ids.
es: Devuelve una tabla de id de objeto.

source: Each id belongs to a child of the collection with ID objectID.
es: Cada uno de ellos pertenece a un hijo de la colección cuyo ID es IDobjeto.

source: The array contains all children both documents and collections.
es: La tabla contiene tanto los documentos como las colecciones hijas.

source: Returns an array of object records.
es: Devuelve una tabla de registros de objeto.

source: Each object record belongs to a child of the collection with ID objectID.
es: Cada uno de ellos pertenece a un hijo de la colección cuyo ID es IDobjeto.

source: Returns FALSE if connection is not a valid connection index, otherwise TRUE.
es: Devuelve FALSE si la conexión no es un índice válido de conexión, y TRUE en caso contrario.

source: Closes down the connection to a Hyperwave server with the given connection index.
es: Cierra la conexión dada con el servidor de Hyperwave.

source: Opens a connection to a Hyperwave server and returns a connection index on success, or FALSE if the connection could not be made.
es: Abre una conexión con un servidor Hyperwave y devuelve un índice de conexión si hay éxito, o FALSE si la conexión no se pudo realizar.

source: Each of the arguments should be a quoted string, except for the port number.
es: Cada argumento debe ser una cadena entrecomillada salvo el número de puerto.

source: The username and password arguments are optional and can be left out.
es: Los argumentos de usuario y clave Los argumentos de usuario y clave son opcionales y pueden omitirse.

source: In such a case no identification with the server will be done.
es: En tal caso no se realizará identificación alguna con el servidor.

source: It is similar to identify as user anonymous.
es: Es similar a identificarse como el usuario 'anonymous'.

source: This function returns a connection index that is needed by other Hyperwave functions.
es: Esta función devuelve un índice de conexión que se necesita para otras funciones Hyperwave.

source: You can have multiple connections open at once.
es: Puede tener varias conexiones abiertas a la vez.

source: Keep in mind, that the password is not encrypted.
es: Recuerde que la clave no está encriptada.

source: See also hw_pconnect().
es: Vea también hw_pConnect().

source: Copies the objects with object ids as specified in the second parameter to the collection with the id destination id.
es: Copia los objetos cuyos id se especifican en el segundo parámetro a la colección identificada como id destino.

source: The value return is the number of copied objects.
es: El valor devuelto es el número de objetos copiados.

source: See also hw_mv().
es: Vea también hw_mv().

source: Deletes the object with the given object id in the second parameter.
es: Borra el objeto con el id dado como segundo parámetro.

source: It will delete all instances of the object.
es: Borrará todas las instancias del mismo.

source: Returns TRUE if no error occurs otherwise FALSE.
es: Devuelve TRUE si no hay error o FALSE en caso contrario.

source: Returns an th object id of the document to which anchorID belongs.
es: Devuelve el id de objeto del documento al que pertenece el IDenlace.

source: Returns an th object record of the document to which anchorID belongs.
es: Devuelve el registro de objeto del documento al que pertenece el IDenlace.

source: Uploads the text document to the server.
es: Envía el documento de texto al servidor.

source: The object record of the document may not be modified while the document is edited.
es: El registro de objeto del documento no puede ser modificado mientras el documento es editado.

source: This function will only works for pure text documents.
es: Esta función sólo funcionará para objetos puros de texto.

source: It will not open a special data connection and therefore blocks the control connection during the transfer.
es: No abrirá ninguna conexión especial de datos y por tanto bloquea la conexión de control durante la transferencia.
